<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的多应用管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

namespace addon\shop\app\listener\third_addon;

/**
 * 对接秒杀查询
 */
class SupportAddonListener
{

    //已对接的营销活动在这里配置
    public function handle($source)
    {
        $shop_arr = [
            'key' => 'shop',
            'name' => '商城'
        ];
        $data = [
            'seckill' => $shop_arr,
            'pintuan' => $shop_arr
        ];
        return $data[$source] ?? [];
    }
}